[
    {
        "responses": [
            [
                "xkge",
                "I know that a disinfectant brush is often in a cabinet, a cabinet often can contain a brush, and a brush is often in a kitchen table. Therefore, it is possible that a disinfectant brush is often in a kitchen table."
            ],
            [
                "causal",
                "I will move from the table to the kitchen table to later grab the disinfectant brush from the kitchen table."
            ]
        ],
        "plan": [
            [
                "Move to the kitchen table",
                "Interrupted Action"
            ],
            [
                "Observe disinfectant brush at kitchen table",
                "Next Action"
            ],
            [
                "Grab the disinfectant brush",
                "Future Action"
            ]
        ],
        "relation": "ObjOnLoc",
        "why_q1": "Why do you think you will find a disinfectant brush on a kitchen table?",
        "why_q2": "Why will you move to the kitchen table?",
        "video": "videos/move1.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that a disinfectant brush is often in a cabinet, a cabinet often can contain a detergent container, and a detergent container is used to disinfect. Therefore, it is possible that a disinfectant brush is used to disinfect."
            ],
            [
                "causal",
                "I will take the disinfectant brush to later be able to disinfect the table with the disinfectant brush."
            ]
        ],
        "plan": [
            [
                "Grab the disinfectant brush",
                "Interrupted Action"
            ],
            [
                "Move to the kitchen table",
                "Next Action"
            ],
            [
                "Disinfect the kitchen table with the disinfectant brush",
                "Future Action"
            ]
        ],
        "relation": "ObjUsedTo",
        "why_q1": "Why do you think a disinfectant brush is used to disinfect?",
        "why_q2": "Why will you grab the disinfectant brush?",
        "video": "videos/grab_duster.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that a scrubber is often in a cabinet, a cabinet often can contain a brush, and a brush is used to scrub. Therefore, it is possible that a scrubber is used to scrub."
            ],
            [
                "causal",
                "I will take the scrubber to later be able to scrub the table with the scrubber."
            ]
        ],
        "plan": [
            [
                "Grab the scrubber",
                "Interrupted Action"
            ],
            [
                "Move to the kitchen table",
                "Next Action"
            ],
            [
                "Scrub the kitchen table with the scrubber",
                "Future Action"
            ]
        ],
        "relation": "ObjUsedTo",
        "why_q1": "Why do you think a scrubber is used to scrub?",
        "why_q2": "Why will you grab the scrubber?",
        "video": "videos/grab_scrubber.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that a washing sponge is used to sponge, a faucet can be sponged, a faucet is usually used on a brush, and a brush is often in a sink. Therefore, it is possible that a washing sponge is often in a sink."
            ],
            [
                "causal",
                "I will move from the table to the sink to later grab the washing sponge from the sink."
            ]
        ],
        "plan": [
            [
                "Move to the sink",
                "Interrupted Action"
            ],
            [
                "Observe washing sponge at sink",
                "Next Action"
            ],
            [
                "Grab the washing sponge",
                "Future Action"
            ]
        ],
        "relation": "ObjInLoc",
        "why_q1": "Why do you think you will find a washing sponge in a sink?",
        "why_q2": "Why will you move to the sink?",
        "video": "videos/move2.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that a cleaning rag is often in a cabinet, a cabinet often can contain a towel, and a towel is used to wipe. Therefore, it is possible that a cleaning rag is used to wipe."
            ],
            [
                "causal",
                "I will take the cleaning rag to later be able to wipe the table with the cleaning rag."
            ]
        ],
        "plan": [
            [
                "Grab the cleaning rag",
                "Interrupted Action"
            ],
            [
                "Move to the kitchen table",
                "Next Action"
            ],
            [
                "Wipe the kitchen table with the cleaning rag",
                "Future Action"
            ]
        ],
        "relation": "ObjUsedTo",
        "why_q1": "Why do you think a cleaning rag is used to wipe?",
        "why_q2": "Why will you grab the cleaning rag?",
        "video": "videos/grab_towel.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that a scrubber can be washed, washing can be done using a faucet, a brush is usually used on a faucet, and a brush is often in a sink. Therefore, it is possible that a scrubber is often in a sink."
            ],
            [
                "causal",
                "I will move from the table to the sink to later grab the scrubber from the sink."
            ]
        ],
        "plan": [
            [
                "Move to the sink",
                "Interrupted Action"
            ],
            [
                "Observe scrubber at sink",
                "Next Action"
            ],
            [
                "Grab the scrubber",
                "Future Action"
            ]
        ],
        "relation": "ObjOnLoc",
        "why_q1": "Why do you think you will find a scrubber on a sink?",
        "why_q2": "Why will you move to the sink?",
        "video": "videos/move3.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that disinfecting can be done using a bottle of bleach, and a bottle of bleach can be clean. Therefore, it is possible that the act of disinfecting an object will make it clean."
            ],
            [
                "causal",
                "I will disinfect the table to fulfill the goal of the table being clean."
            ]
        ],
        "plan": [
            [
                "Disinfect the kitchen table with the disinfectant brush",
                "Interrupted Action"
            ],
            [
                "Observe kitchen table clean",
                "Next Action"
            ]
        ],
        "relation": "HasEffect",
        "why_q1": "Why do you think the act of disinfecting an object will make it clean?",
        "why_q2": "Why will you disinfect the kitchen table with the disinfectant brush?",
        "video": "videos/clean_duster.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that a washing sponge is often in a cabinet, a cabinet often can contain a cloth, and a cloth is used to sponge. Therefore, it is possible that a washing sponge is used to sponge."
            ],
            [
                "causal",
                "I will take the washing sponge to later be able to sponge the table with the washing sponge."
            ]
        ],
        "plan": [
            [
                "Grab the washing sponge",
                "Interrupted Action"
            ],
            [
                "Move to the kitchen table",
                "Next Action"
            ],
            [
                "Sponge the kitchen table with the washing sponge",
                "Future Action"
            ]
        ],
        "relation": "ObjUsedTo",
        "why_q1": "Why do you think a washing sponge is used to sponge?",
        "why_q2": "Why will you grab the washing sponge?",
        "video": "videos/grab_sponge.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that a cleaning rag is often in a cabinet, a cabinet often can contain a feather duster, and a feather duster is often in a kitchen counter. Therefore, it is possible that a cleaning rag is often in a kitchen counter."
            ],
            [
                "causal",
                "I will move from the table to the kitchen counter to later grab the cleaning rag from the kitchen counter."
            ]
        ],
        "plan": [
            [
                "Move to the kitchen counter",
                "Interrupted Action"
            ],
            [
                "Observe cleaning rag at kitchen counter",
                "Next Action"
            ],
            [
                "Grab the cleaning rag",
                "Future Action"
            ]
        ],
        "relation": "ObjOnLoc",
        "why_q1": "Why do you think you will find a cleaning rag on a kitchen counter?",
        "why_q2": "Why will you move to the kitchen counter?",
        "video": "videos/move4.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that a feather duster is often in a cabinet, a cabinet often can contain a wash cloth, and a wash cloth is used to dust. Therefore, it is possible that a feather duster is used to dust."
            ],
            [
                "causal",
                "I will take the feather duster to later be able to dust the table with the feather duster."
            ]
        ],
        "plan": [
            [
                "Grab the feather duster",
                "Interrupted Action"
            ],
            [
                "Move to the kitchen table",
                "Next Action"
            ],
            [
                "Dust the kitchen table with the feather duster",
                "Future Action"
            ]
        ],
        "relation": "ObjUsedTo",
        "why_q1": "Why do you think a feather duster is used to dust?",
        "why_q2": "Why will you grab the feather duster?",
        "video": "videos/grab_featherduster.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that a feather duster can be disinfected, disinfecting can be done using a bottle of bleach, and a bottle of bleach is often in a cabinet. Therefore, it is possible that a feather duster is often in a cabinet."
            ],
            [
                "causal",
                "I will move from the table to the cabinet to later grab the feather duster from the cabinet."
            ]
        ],
        "plan": [
            [
                "Move to the cabinet",
                "Interrupted Action"
            ],
            [
                "Observe feather duster at cabinet",
                "Next Action"
            ],
            [
                "Grab the feather duster",
                "Future Action"
            ]
        ],
        "relation": "ObjInLoc",
        "why_q1": "Why do you think you will find a feather duster in a cabinet?",
        "why_q2": "Why will you move to the cabinet?",
        "video": "videos/move5.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that sponging can be done using a dish towel, a dish towel is usually used on a wine glass, a wine glass can be scrubbed, and the act of scrubbing an object will make it clean. Therefore, it is possible that the act of sponging an object will make it clean."
            ],
            [
                "causal",
                "I will sponge the table to fulfill the goal of the table being clean."
            ]
        ],
        "plan": [
            [
                "Sponge the kitchen table with the washing sponge",
                "Interrupted Action"
            ],
            [
                "Observe kitchen table clean",
                "Next Action"
            ]
        ],
        "relation": "HasEffect",
        "why_q1": "Why do you think the act of sponging an object will make it clean?",
        "why_q2": "Why will you sponge the kitchen table with the washing sponge?",
        "video": "videos/clean_sponge.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that wiping can be done using a towel, a towel can be dirty, and an object being dirty is the opposite of being clean. Therefore, it is possible that the act of wiping an object will make it clean."
            ],
            [
                "causal",
                "I will wipe the table to fulfill the goal of the table being clean."
            ]
        ],
        "plan": [
            [
                "Wipe the kitchen table with the cleaning rag",
                "Interrupted Action"
            ],
            [
                "Observe kitchen table clean",
                "Next Action"
            ]
        ],
        "relation": "HasEffect",
        "why_q1": "Why do you think the act of wiping an object will make it clean?",
        "why_q2": "Why will you wipe the kitchen table with the cleaning rag?",
        "video": "videos/clean_towel.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that scrubbing can be done using a scouring pad, a scouring pad can be dirty, and an object being dirty is the opposite of being clean. Therefore, it is possible that the act of scrubbing an object will make it clean."
            ],
            [
                "causal",
                "I will scrub the table to fulfill the goal of the table being clean."
            ]
        ],
        "plan": [
            [
                "Scrub the kitchen table with the scrubber",
                "Interrupted Action"
            ],
            [
                "Observe kitchen table clean",
                "Next Action"
            ]
        ],
        "relation": "HasEffect",
        "why_q1": "Why do you think the act of scrubbing an object will make it clean?",
        "why_q2": "Why will you scrub the kitchen table with the scrubber?",
        "video": "videos/clean_scrubber.mp4"
    },
    {
        "responses": [
            [
                "xkge",
                "I know that dusting can be done using a wash cloth, a wash cloth is usually used on a stall, a stall can be mopped, and the act of mopping an object will make it clean. Therefore, it is possible that the act of dusting an object will make it clean."
            ],
            [
                "causal",
                "I will dust the table to fulfill the goal of the table being clean."
            ]
        ],
        "plan": [
            [
                "Dust the kitchen table with the feather duster",
                "Interrupted Action"
            ],
            [
                "Observe kitchen table clean",
                "Next Action"
            ]
        ],
        "relation": "HasEffect",
        "why_q1": "Why do you think the act of dusting an object will make it clean?",
        "why_q2": "Why will you dust the kitchen table with the feather duster?",
        "video": "videos/clean_featherduster.mp4"
    }
]